### Введение в SQL

In [24]:
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(
                      team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')

conn.commit()

print("Table created successfully");

#conn.close()

Opened database successfully
Table created successfully

In [25]:
conn = sqlite3.connect('test.db')

conn.execute('''
CREATE TABLE IF NOT EXISTS team_players(
                      team text, 
                      country text, 
                      player text, 
                      goals integer);''')

conn.commit()

In [26]:
# Добавляем значения

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")


conn.execute("INSERT INTO team_players VALUES('Real Madrid', 'Spain', 'Huan', 10);")
conn.execute("INSERT INTO team_players VALUES('Barcelona', 'Spain', 'Honsales', 10);")
conn.execute("INSERT INTO team_players VALUES('Arsenal', 'UK', 'Bernd Leno', 5);")
conn.execute("INSERT INTO team_players VALUES('Real Madrid', 'Eder Militan', 2018, 4);")
conn.execute("INSERT INTO team_players VALUES('Barcelona', 'Spain', 'Nelsen Semedu', 4);")
conn.execute("INSERT INTO team_players VALUES('Arsenal', 'UK', 'Rob Holding', 5 );")

conn.commit()

In [27]:
#Представления

cur = conn.execute("SELECT goals, team FROM team_players;")

cur.fetchall()

[(10, 'Real Madrid'),
 (10, 'Barcelona'),
 (5, 'Arsenal'),
 (4, 'Real Madrid'),
 (4, 'Barcelona'),
 (5, 'Arsenal')]

In [28]:
#Выборки

cur = conn.execute("SELECT total_goals, team FROM team_data WHERE country != 'UK' OR total_goals> 50 ;")

cur.fetchall()

[(53, 'Real Madrid'),
 (47, 'Barcelona'),
 (52, 'Arsenal'),
 (49, 'Real Madrid'),
 (45, 'Barcelona')]

In [29]:
# Вычисляем среднее

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,country,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 'UK', 51.0)
('Barcelona', 'Spain', 46.0)
('Real Madrid', 'Spain', 51.0)

In [30]:
# Неправильный запрос

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team AS team_name ,
                            AVG(total_goals) AS avg_goals
                          FROM team_data                          
                          GROUP BY team
                          HAVING avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [31]:
# Правильный запрос

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query
                          
                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [32]:
#Joins

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_data.team,team_data.country,player,total_goals, goals
                          
                          FROM team_data
                          INNER JOIN team_players on team_data.team = team_players.team;''')

cursor.fetchall()

[('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Rob Holding', 52, 5),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Rob Holding', 50, 5)]

In [60]:
conn.close()

# SQL Programming - Основы с magic командами

In [62]:
# Загружаем sql extension

%load_ext sql


#
%sql sqlite:////content/test.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @/content/test.db'

In [42]:


%%sql
CREATE TABLE if not exists Customers(
   Id,   
   Name,  
   Age,
   Address,  
   Salary
);

SELECT * From Customers;

 * sqlite:////content/test.db
Done.
Done.

[]

In [43]:

%%sql
CREATE TABLE if not exists Students(
    AdmissionsNo,
    FirstName,
    MiddleName,
    LastName,
    DateOfBirth,
    DateOfAdmission
);
 
SELECT * from Students;

 * sqlite:////content/test.db
Done.
Done.

[]

In [44]:


%%sql
CREATE TABLE IF NOT EXISTS Citizens (
    NationalID int,
    FirstName varchar(255),
    MiddleName varchar(255),
    PostalAddress varchar(255),
    Residence varchar(255));
SELECT * from Citizens;

 * sqlite:////content/test.db
Done.
Done.

[]

In [45]:


%%sql
CREATE TABLE IF NOT EXISTS artists(
    Artist_Id int,
    Artist_Name varchar(60),
    Artist_DOB date,
    Posters_In_Stock boolean);

SELECT * from artists;

 * sqlite:////content/test.db
Done.
Done.

[]

In [46]:


%%sql
CREATE TABLE IF NOT EXISTS Players (
    id int,
    name text,
    age integer,
    height float);

SELECT * from Players;

 * sqlite:////content/test.db
Done.
Done.

[]

## Чтение данных из таблицы с помощью Pandas

In [78]:
import pandas as pd
import sqlite3

con = sqlite3.connect("test.db")

# Load the data into a DataFrame
surveys_df = pd.read_sql_query("SELECT * from team_data", con)

# Select only data for 2002
surveys2002 = surveys_df[surveys_df.season == 2018]

# Write the new DataFrame to a new SQLite table
surveys2002.to_sql("surveys2002", con, if_exists="replace")

con.close()

In [72]:
surveys_df.head()

          team country  season  total_goals
0  Real Madrid   Spain    2019           53
1    Barcelona   Spain    2019           47
2      Arsenal      UK    2019           52
3  Real Madrid   Spain    2018           49
4    Barcelona   Spain    2018           45

In [73]:
surveys2002.head()

          team country  season  total_goals
3  Real Madrid   Spain    2018           49
4    Barcelona   Spain    2018           45
5      Arsenal      UK    2018           50

In [85]:
import pandas as pd
import sqlite3

con = sqlite3.connect("test.db")

# Load the data into a DataFrame
cur = con.execute("SELECT * FROM surveys2002;")

cur.fetchall()

[(3, 'Real Madrid', 'Spain', 2018, 49),
 (4, 'Barcelona', 'Spain', 2018, 45),
 (5, 'Arsenal', 'UK', 2018, 50)]

In [86]:
con.close()